app/controllers/players_controller.rb

SELECT `players`.* FROM `players` WHERE `players`.`id` = ? LIMIT 1  [["id", "11"]]
---
  def show
    @player = Player.find(params[:id])

SELECT `players`.* FROM `players` WHERE `players`.`id` = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @player = Player.find(params[:id])